print("Задача №1")
x1 = int(input("Введите первое число: "))
x2 = int(input("Введите второе число: "))
x3 = int(input("Введите третье число: "))
x4 = x1 + x2 + x3
x5 = x1 * x2 * x3
print(f"Сумма чисел: {x4}\nПроизведение чисел: {x5}")

print("Задача №2")
a1 = int(input("Введите зарплату за месяц в рублях: "))
a2 = int(input("Введите сумму ежемесячного платежа по кредиту в банке в рублях: "))
a3 = int(input("Введите задолженность за коммунальные услуги на начало месяца в рублях: "))
a4 = a1 - a2 - a3
print(f"Сумма, оставшаяся после всех выплат: {a4}")

print("Задача №3")
b1 = float(input("Введите длину первой диагонали в мм: "))
b2 = float(input("Введите длину второй диагонали в мм: "))
s = (b1 * b2) / 2
print(f"При длинах диагоналей равных {b1} и {b2} мм - площадь ромба равна: {s} мм")

print("Задача №4")
print("To be\nor not\nto be")

print("Задача №5")
print("\"Life is what happens\n\twhen\n\t\tyou're busy making other plans”\n\t\t\t\t\tJohn Lennon.")